MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA704/mcu.h
#define IPC13 IPC13
extern volatile uint16_t IPC13 __attribute__((__sfr__));
__extension__ typedef struct tagIPC13BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t INT3IP:3;
      uint16_t :1;
      uint16_t INT4IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t INT3IP0:1;
      uint16_t INT3IP1:1;
      uint16_t INT3IP2:1;
      uint16_t :1;
      uint16_t INT4IP0:1;
      uint16_t INT4IP1:1;
      uint16_t INT4IP2:1;
    };
  };
} IPC13BITS;
extern volatile IPC13BITS IPC13bits __attribute__((__sfr__));

#define IPC14 IPC14
extern volatile uint16_t IPC14 __attribute__((__sfr__));
__extension__ typedef struct tagIPC14BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t SPI1RXIP:3;
      uint16_t :1;
      uint16_t SPI2RXIP:3;
    };
    struct {
      uint16_t :8;
      uint16_t SPI1RXIP0:1;
      uint16_t SPI1RXIP1:1;
      uint16_t SPI1RXIP2:1;
      uint16_t :1;
      uint16_t SPI2RXIP0:1;
      uint16_t SPI2RXIP1:1;
      uint16_t SPI2RXIP2:1;
    };
  };
} IPC14BITS;
extern volatile IPC14BITS IPC14bits __attribute__((__sfr__));

#define IPC15 IPC15
extern volatile uint16_t IPC15 __attribute__((__sfr__));
__extension__ typedef struct tagIPC15BITS {
  union {
    struct {
      uint16_t SPI3RXIP:3;
      uint16_t :1;
      uint16_t DMA5IP:3;
      uint16_t :1;
      uint16_t RTCIP:3;
      uint16_t :1;
      uint16_t CCP1IP:3;
    };
    struct {
      uint16_t SPI3RXIP0:1;
      uint16_t SPI3RXIP1:1;
      uint16_t SPI3RXIP2:1;
      uint16_t :1;
      uint16_t DMA5IP0:1;
      uint16_t DMA5IP1:1;
      uint16_t DMA5IP2:1;
      uint16_t :1;
      uint16_t RTCIP0:1;
      uint16_t RTCIP1:1;
      uint16_t RTCIP2:1;
      uint16_t :1;
      uint16_t CCP1IP0:1;
      uint16_t CCP1IP1:1;
      uint16_t CCP1IP2:1;
    };
  };
} IPC15BITS;
extern volatile IPC15BITS IPC15bits __attribute__((__sfr__));

#define IPC16 IPC16
extern volatile uint16_t IPC16 __attribute__((__sfr__));
__extension__ typedef struct tagIPC16BITS {
  union {
    struct {
      uint16_t CCP2IP:3;
      uint16_t :1;
      uint16_t U1ERIP:3;
      uint16_t :1;
      uint16_t U2ERIP:3;
      uint16_t :1;
      uint16_t CRCIP:3;
    };
    struct {
      uint16_t CCP2IP0:1;
      uint16_t CCP2IP1:1;
      uint16_t CCP2IP2:1;
      uint16_t :1;
      uint16_t U1ERIP0:1;
      uint16_t U1ERIP1:1;
      uint16_t U1ERIP2:1;
      uint16_t :1;
      uint16_t U2ERIP0:1;
      uint16_t U2ERIP1:1;
      uint16_t U2ERIP2:1;
      uint16_t :1;
      uint16_t CRCIP0:1;
      uint16_t CRCIP1:1;
      uint16_t CRCIP2:1;
    };
  };
} IPC16BITS;
extern volatile IPC16BITS IPC16bits __attribute__((__sfr__));

#define IPC17 IPC17
extern volatile uint16_t IPC17 __attribute__((__sfr__));
typedef struct tagIPC17BITS {
  uint16_t DMA6IP0:1;
  uint16_t DMA6IP1:1;
  uint16_t DMA6IP2:1;
  uint16_t :1;
  uint16_t DMA7IP0:1;
  uint16_t DMA7IP1:1;
  uint16_t DMA7IP2:1;
  uint16_t :1;
  uint16_t SI2C3IP0:1;
  uint16_t SI2C3IP1:1;
  uint16_t SI2C3IP2:1;
  uint16_t :1;
  uint16_t MI2C3IP0:1;
  uint16_t MI2C3IP1:1;
  uint16_t MI2C3IP2:1;
} IPC17BITS;
extern volatile IPC17BITS IPC17bits __attribute__((__sfr__));

#define IPC18 IPC18
extern volatile uint16_t IPC18 __attribute__((__sfr__));
__extension__ typedef struct tagIPC18BITS {
  union {
    struct {
      uint16_t LVDIP:3;
    };
    struct {
      uint16_t LVDIP0:1;
      uint16_t LVDIP1:1;
      uint16_t LVDIP2:1;
      uint16_t :1;
      uint16_t CCP7IP0:1;
      uint16_t CCP7IP1:1;
      uint16_t CCP7IP2:1;
    };
  };
} IPC18BITS;
extern volatile IPC18BITS IPC18bits __attribute__((__sfr__));

#define IPC19 IPC19
extern volatile uint16_t IPC19 __attribute__((__sfr__));
__extension__ typedef struct tagIPC19BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t CTMUIP:3;
    };
    struct {
      uint16_t :4;
      uint16_t CTMUIP0:1;
      uint16_t CTMUIP1:1;
      uint16_t CTMUIP2:1;
    };
  };
} IPC19BITS;
extern volatile IPC19BITS IPC19bits __attribute__((__sfr__));

#define IPC20 IPC20
extern volatile uint16_t IPC20 __attribute__((__sfr__));
typedef struct tagIPC20BITS {
  uint16_t :4;
  uint16_t U3ERIP0:1;
  uint16_t U3ERIP1:1;
  uint16_t U3ERIP2:1;
  uint16_t :1;
  uint16_t U3RXIP0:1;
  uint16_t U3RXIP1:1;
  uint16_t U3RXIP2:1;
  uint16_t :1;
  uint16_t U3TXIP0:1;
  uint16_t U3TXIP1:1;
  uint16_t U3TXIP2:1;
} IPC20BITS;
extern volatile IPC20BITS IPC20bits __attribute__((__sfr__));

#define IPC21 IPC21
extern volatile uint16_t IPC21 __attribute__((__sfr__));
__extension__ typedef struct tagIPC21BITS {
  union {
    struct {
      uint16_t I2C1BCIP:3;
      uint16_t :1;
      uint16_t I2C2BCIP:3;
    };
    struct {
      uint16_t :8;
      uint16_t USB1IP0:1;
      uint16_t USB1IP1:1;
      uint16_t USB1IP2:1;
      uint16_t :1;
      uint16_t U4ERIP0:1;
      uint16_t U4ERIP1:1;
      uint16_t U4ERIP2:1;
    };
  };
} IPC21BITS;
extern volatile IPC21BITS IPC21bits __attribute__((__sfr__));

#define IPC22 IPC22
extern volatile uint16_t IPC22 __attribute__((__sfr__));
__extension__ typedef struct tagIPC22BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t SPI3IP:3;
      uint16_t :1;
      uint16_t SPI3TXIP:3;
    };
    struct {
      uint16_t U4RXIP0:1;
      uint16_t U4RXIP1:1;
      uint16_t U4RXIP2:1;
      uint16_t :1;
      uint16_t U4TXIP0:1;
      uint16_t U4TXIP1:1;
      uint16_t U4TXIP2:1;
      uint16_t :1;
      uint16_t SPI3IP0:1;
      uint16_t SPI3IP1:1;
      uint16_t SPI3IP2:1;
      uint16_t :1;
      uint16_t SPI3TXIP0:1;
      uint16_t SPI3TXIP1:1;
      uint16_t SPI3TXIP2:1;
    };
  };
} IPC22BITS;
extern volatile IPC22BITS IPC22bits __attribute__((__sfr__));

#define IPC23 IPC23
extern volatile uint16_t IPC23 __attribute__((__sfr__));
__extension__ typedef struct tagIPC23BITS {
  union {
    struct {
      uint16_t :8;
      uint16_t CCP3IP:3;
      uint16_t :1;
      uint16_t CCP4IP:3;
    };
    struct {
      uint16_t :8;
      uint16_t CCP3IP0:1;
      uint16_t CCP3IP1:1;
      uint16_t CCP3IP2:1;
      uint16_t :1;
      uint16_t CCP4IP0:1;
      uint16_t CCP4IP1:1;
      uint16_t CCP4IP2:1;
    };
  };
} IPC23BITS;
extern volatile IPC23BITS IPC23bits __attribute__((__sfr__));

#define IPC24 IPC24
extern volatile uint16_t IPC24 __attribute__((__sfr__));
__extension__ typedef struct tagIPC24BITS {
  union {
    struct {
      uint16_t CLC1IP:3;
      uint16_t :1;
      uint16_t CLC2IP:3;
    };
    struct {
      uint16_t CLC1IP0:1;
      uint16_t CLC1IP1:1;
      uint16_t CLC1IP2:1;
      uint16_t :1;
      uint16_t CLC2IP0:1;
      uint16_t CLC2IP1:1;
      uint16_t CLC2IP2:1;
      uint16_t :1;
      uint16_t CLC3IP0:1;
      uint16_t CLC3IP1:1;
      uint16_t CLC3IP2:1;
      uint16_t :1;
      uint16_t CLC4IP0:1;
      uint16_t CLC4IP1:1;
      uint16_t CLC4IP2:1;
    };
  };
} IPC24BITS;
extern volatile IPC24BITS IPC24bits __attribute__((__sfr__));

#define IPC25 IPC25
extern volatile uint16_t IPC25 __attribute__((__sfr__));
__extension__ typedef struct tagIPC25BITS {
  union {
    struct {
      uint16_t :4;
      uint16_t CCT1IP:3;
      uint16_t :1;
      uint16_t CCT2IP:3;
    };
    struct {
      uint16_t :4;
      uint16_t CCT1IP0:1;
      uint16_t CCT1IP1:1;
      uint16_t CCT1IP2:1;
      uint16_t :1;
      uint16_t CCT2IP0:1;
      uint16_t CCT2IP1:1;
      uint16_t CCT2IP2:1;
    };
  };
} IPC25BITS;
extern volatile IPC25BITS IPC25bits __attribute__((__sfr__));

