MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA704/mcu.h
#define _U2SCCON_TXRPT0_POSITION                 0x00000004
#define _U2SCCON_TXRPT0_MASK                     0x00000010
#define _U2SCCON_TXRPT0_LENGTH                   0x00000001

#define _U2SCCON_TXRPT1_POSITION                 0x00000005
#define _U2SCCON_TXRPT1_MASK                     0x00000020
#define _U2SCCON_TXRPT1_LENGTH                   0x00000001

#define _U2SCINT_GTCIE_POSITION                  0x00000000
#define _U2SCINT_GTCIE_MASK                      0x00000001
#define _U2SCINT_GTCIE_LENGTH                    0x00000001

#define _U2SCINT_WTCIE_POSITION                  0x00000001
#define _U2SCINT_WTCIE_MASK                      0x00000002
#define _U2SCINT_WTCIE_LENGTH                    0x00000001

#define _U2SCINT_TXRPTIE_POSITION                0x00000004
#define _U2SCINT_TXRPTIE_MASK                    0x00000010
#define _U2SCINT_TXRPTIE_LENGTH                  0x00000001

#define _U2SCINT_RXRPTIE_POSITION                0x00000005
#define _U2SCINT_RXRPTIE_MASK                    0x00000020
#define _U2SCINT_RXRPTIE_LENGTH                  0x00000001

#define _U2SCINT_PARIE_POSITION                  0x00000006
#define _U2SCINT_PARIE_MASK                      0x00000040
#define _U2SCINT_PARIE_LENGTH                    0x00000001

#define _U2SCINT_GTCIF_POSITION                  0x00000008
#define _U2SCINT_GTCIF_MASK                      0x00000100
#define _U2SCINT_GTCIF_LENGTH                    0x00000001

#define _U2SCINT_WTCIF_POSITION                  0x00000009
#define _U2SCINT_WTCIF_MASK                      0x00000200
#define _U2SCINT_WTCIF_LENGTH                    0x00000001

#define _U2SCINT_TXRPTIF_POSITION                0x0000000C
#define _U2SCINT_TXRPTIF_MASK                    0x00001000
#define _U2SCINT_TXRPTIF_LENGTH                  0x00000001

#define _U2SCINT_RXRPTIF_POSITION                0x0000000D
#define _U2SCINT_RXRPTIF_MASK                    0x00002000
#define _U2SCINT_RXRPTIF_LENGTH                  0x00000001

#define _U2GTC_GTC_POSITION                      0x00000000
#define _U2GTC_GTC_MASK                          0x000001FF
#define _U2GTC_GTC_LENGTH                        0x00000009

#define _U2GTC_GTC0_POSITION                     0x00000000
#define _U2GTC_GTC0_MASK                         0x00000001
#define _U2GTC_GTC0_LENGTH                       0x00000001

#define _U2GTC_GTC1_POSITION                     0x00000001
#define _U2GTC_GTC1_MASK                         0x00000002
#define _U2GTC_GTC1_LENGTH                       0x00000001

#define _U2GTC_GTC2_POSITION                     0x00000002
#define _U2GTC_GTC2_MASK                         0x00000004
#define _U2GTC_GTC2_LENGTH                       0x00000001

#define _U2GTC_GTC3_POSITION                     0x00000003
#define _U2GTC_GTC3_MASK                         0x00000008
#define _U2GTC_GTC3_LENGTH                       0x00000001

#define _U2GTC_GTC4_POSITION                     0x00000004
#define _U2GTC_GTC4_MASK                         0x00000010
#define _U2GTC_GTC4_LENGTH                       0x00000001

#define _U2GTC_GTC5_POSITION                     0x00000005
#define _U2GTC_GTC5_MASK                         0x00000020
#define _U2GTC_GTC5_LENGTH                       0x00000001

#define _U2GTC_GTC6_POSITION                     0x00000006
#define _U2GTC_GTC6_MASK                         0x00000040
#define _U2GTC_GTC6_LENGTH                       0x00000001

#define _U2GTC_GTC7_POSITION                     0x00000007
#define _U2GTC_GTC7_MASK                         0x00000080
#define _U2GTC_GTC7_LENGTH                       0x00000001

#define _U2GTC_GTC8_POSITION                     0x00000008
#define _U2GTC_GTC8_MASK                         0x00000100
#define _U2GTC_GTC8_LENGTH                       0x00000001

#define _U2WTCL_WTCL_POSITION                    0x00000000
#define _U2WTCL_WTCL_MASK                        0x0000FFFF
#define _U2WTCL_WTCL_LENGTH                      0x00000010

#define _U2WTCL_WTC0_POSITION                    0x00000000
#define _U2WTCL_WTC0_MASK                        0x00000001
#define _U2WTCL_WTC0_LENGTH                      0x00000001

#define _U2WTCL_WTC1_POSITION                    0x00000001
#define _U2WTCL_WTC1_MASK                        0x00000002
#define _U2WTCL_WTC1_LENGTH                      0x00000001

#define _U2WTCL_WTC2_POSITION                    0x00000002
#define _U2WTCL_WTC2_MASK                        0x00000004
#define _U2WTCL_WTC2_LENGTH                      0x00000001

#define _U2WTCL_WTC3_POSITION                    0x00000003
#define _U2WTCL_WTC3_MASK                        0x00000008
#define _U2WTCL_WTC3_LENGTH                      0x00000001

#define _U2WTCL_WTC4_POSITION                    0x00000004
#define _U2WTCL_WTC4_MASK                        0x00000010
#define _U2WTCL_WTC4_LENGTH                      0x00000001

#define _U2WTCL_WTC5_POSITION                    0x00000005
#define _U2WTCL_WTC5_MASK                        0x00000020
#define _U2WTCL_WTC5_LENGTH                      0x00000001

#define _U2WTCL_WTC6_POSITION                    0x00000006
#define _U2WTCL_WTC6_MASK                        0x00000040
#define _U2WTCL_WTC6_LENGTH                      0x00000001

#define _U2WTCL_WTC7_POSITION                    0x00000007
#define _U2WTCL_WTC7_MASK                        0x00000080
#define _U2WTCL_WTC7_LENGTH                      0x00000001

#define _U2WTCL_WTC8_POSITION                    0x00000008
#define _U2WTCL_WTC8_MASK                        0x00000100
#define _U2WTCL_WTC8_LENGTH                      0x00000001

#define _U2WTCL_WTC9_POSITION                    0x00000009
#define _U2WTCL_WTC9_MASK                        0x00000200
#define _U2WTCL_WTC9_LENGTH                      0x00000001

#define _U2WTCL_WTC10_POSITION                   0x0000000A
#define _U2WTCL_WTC10_MASK                       0x00000400
#define _U2WTCL_WTC10_LENGTH                     0x00000001

#define _U2WTCL_WTC11_POSITION                   0x0000000B
#define _U2WTCL_WTC11_MASK                       0x00000800
#define _U2WTCL_WTC11_LENGTH                     0x00000001

