MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ64GA704/mcu.h
/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   ICD Communication Channel Select bits:
**     ICS_NONE             Reserved, do not use
**     ICS_PGD3             Communicate on PGEC3 and PGED3
**     ICS_PGD2             Communicate on PGEC2 and PGED2
**     ICS_PGD1             Communicate on PGEC1 and PGED1
**
**   JTAG Enable bit:
**     JTAGEN_OFF           JTAG is disabled
**     JTAGEN_ON            JTAG is enabled
**
*/

#define ICS_NONE             0x00A0
#define ICS_PGD3             0x00A1
#define ICS_PGD2             0x00A2
#define ICS_PGD1             0x00A3

#define JTAGEN_OFF           0x0083
#define JTAGEN_ON            0x00A3

/* Register FDEVOPT1 (0xaf2c)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDEVOPT1;
#define _FDEVOPT1(x) __attribute__((address(0xaf2c),deprecated_definition("consider migrating to #pragma config"),section("__FDEVOPT1.sec"),space(prog))) __prog__ uint16_t _FDEVOPT1 = (x);

/*
** Only one invocation of FDEVOPT1 should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDEVOPT1.
** Multiple options may be combined, as shown:
**
** _FDEVOPT1( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Alternate Comparator Input Enable bit:
**     ALTCMPI_ENABLE       C1INC, C2INC and C3INC are on RB9
**     ALTCMPI_DISABLE      C1INC, C2INC, and C3INC are on their standard pin locations
**
**   Tamper Pin Enable bit:
**     TMPRPIN_ON           TMPRN pin function is enabled
**     TMPRPIN_OFF          TMPRN pin function is disabled
**
**   SOSC High Power Enable bit (valid only when SOSCSEL = 1:
**     SOSCHP_OFF           Enable SOSC low power mode
**     SOSCHP_ON            Enable SOSC high power mode (default)
**
**   Alternate I2C pin Location:
**     ALTI2C1_ALTI2CDIS    ASDA1 and ASCL1 on RB5 and RB6
**     ALTI2C1_ALTI2CEN     SDA1 and SCL1 on RB9 and RB8
**
*/

#define ALTCMPI_ENABLE       0x001C
#define ALTCMPI_DISABLE      0x001E

#define TMPRPIN_ON           0x001A
#define TMPRPIN_OFF          0x001E

#define SOSCHP_OFF           0x0016
#define SOSCHP_ON            0x001E

#define ALTI2C1_ALTI2CDIS    0x000E
#define ALTI2C1_ALTI2CEN     0x001E



/*
 * Flash Programming Information
 */

#undef _FLASH_PAGE
#define _FLASH_PAGE 0x400

#undef _FLASH_ROW
#define _FLASH_ROW 0xc0

/*
 * Memory Segments Sizes
 */

#define __AIVT_BASE 0x0
#define __AIVT_LENGTH 0x100

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x100
#define __PROGRAM_LENGTH 0xae00

#define __FSEC_BASE 0xaf00
#define __FSEC_LENGTH 0x2

#define __FBSLIM_BASE 0xaf10
#define __FBSLIM_LENGTH 0x2

#define __FSIGN_BASE 0xaf14
#define __FSIGN_LENGTH 0x2

#define __FOSCSEL_BASE 0xaf18
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xaf1c
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xaf20
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xaf24
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xaf28
#define __FICD_LENGTH 0x2

#define __FDEVOPT1_BASE 0xaf2c
#define __FDEVOPT1_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x4000

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x4000

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x4000


/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_C1OUT 1
#define _RPOUT_C2OUT 2
#define _RPOUT_U1TX 3
#define _RPOUT_U1RTS 4
#define _RPOUT_U2TX 5
#define _RPOUT_U2RTS 6
#define _RPOUT_SDO1 7
#define _RPOUT_SCK1OUT 8
#define _RPOUT_SS1OUT 9
#define _RPOUT_SDO2 10
#define _RPOUT_SCK2OUT 11
#define _RPOUT_SS2OUT 12
#define _RPOUT_OC1 13
#define _RPOUT_OC2 14
#define _RPOUT_OC3 15
#define _RPOUT_OCM2A 16
#define _RPOUT_OCM2B 17
#define _RPOUT_OCM3A 18
#define _RPOUT_OCM3B 19
#define _RPOUT_OCM4A 20
#define _RPOUT_OCM4B 21
#define _RPOUT_SDO3 23
#define _RPOUT_SCK3OUT 24
#define _RPOUT_SS3OUT 25
#define _RPOUT_C3OUT 26
#define _RPOUT_PWRGT 27
#define _RPOUT_REFO 28
#define _RPOUT_CLC1OUT 29
#define _RPOUT_CLC2OUT 30
#define _RPOUT_RTCC 31

#endif
